#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.single_zone.data.archive_file.revalidation_function[0]: Reading...
module.single_zone.data.archive_file.warmer_function[0]: Reading...
module.single_zone.data.archive_file.image_optimisation_function[0]: Reading...
module.single_zone.data.archive_file.revalidation_function[0]: Read complete after 0s [id=e2c0382d7f23f8cd5bf717aeb39013f1a8e1857b]
module.single_zone.data.archive_file.warmer_function[0]: Read complete after 0s [id=e5094e337d97bf663bebb451657f5785a9dda36d]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Reading...
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Reading...
module.single_zone.module.public_resources[0].aws_cloudfront_cache_policy.cache_policy[0]: Refreshing state... [id=06efa7e0-f0db-4669-832e-5b76036eb9b1]
module.http-redirect.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:615299762949:certificate/c69ccd6e-eece-4944-b5d5-e191ea5376aa]
module.single_zone.module.public_resources[0].aws_cloudfront_origin_access_control.website_origin_access_control: Refreshing state... [id=E3RNQ0V4MAIQ68]
module.single_zone.module.public_resources[0].data.aws_region.current: Reading...
module.single_zone.module.public_resources[0].aws_cloudfront_function.x_forwarded_host: Refreshing state... [id=vltech-website-x-forwarded-host-function]
module.single_zone.module.public_resources[0].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Read complete after 0s [id=b689b0a8-53d0-40ab-baf2-68738e2966ac]
module.single_zone.data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.single_zone.module.revalidation_function.data.aws_region.current: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Reading...
module.http-redirect.aws_cloudfront_function.redirect: Refreshing state... [id=http-redirect]
module.single_zone.module.server_function.data.aws_caller_identity.current: Reading...
module.single_zone.module.server_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-server-function-role]
module.single_zone.module.image_optimisation_function[0].aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-image-optimization-function-role]
module.single_zone.module.revalidation_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.http-redirect.data.aws_route53_zone.zone: Reading...
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Reading...
module.single_zone.aws_sqs_queue.revalidation_queue: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/615299762949/vltech-website-isr-queue.fifo]
module.single_zone.data.archive_file.image_optimisation_function[0]: Read complete after 1s [id=c1a062ac6d52992a4e9f669a9529d8d7e32e7497]
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=615299762949]
module.single_zone.module.revalidation_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-revalidation-function-role]
module.single_zone.module.server_function.data.aws_caller_identity.current: Read complete after 1s [id=615299762949]
module.single_zone.module.open_next_aliases[0].aws_ssm_parameter.origin_aliases: Refreshing state... [id=vltech-website-website-origin-aliases]
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.aws_dynamodb_table.isr_table[0]: Refreshing state... [id=vltech-website-isr-tag-mapping]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Read complete after 0s [id=Z01305181G23H04WP32YA]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Reading...
module.http-redirect.data.aws_route53_zone.zone: Read complete after 1s [id=Z01305181G23H04WP32YA]
module.single_zone.module.server_function.data.aws_region.current: Reading...
module.single_zone.module.server_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.aws_s3_bucket.bucket[0]: Refreshing state... [id=vltech-website-website-bucket]
module.http-redirect.aws_route53_record.cert_validation["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA__abc41aced5334d86bdd43adac171c372.victorlevasseur.tech._CNAME]
module.single_zone.module.image_optimisation_function[0].aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-image-optimization-function]
module.single_zone.module.server_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-server-function]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.revalidation_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-revalidation-function]
module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-revalidation-function]
module.http-redirect.aws_acm_certificate_validation.cert: Refreshing state... [id=2025-02-13 14:11:52.205 +0000 UTC]
module.http-redirect.aws_cloudfront_distribution.distribution: Refreshing state... [id=E3AXV12PY17NPX]
module.http-redirect.aws_route53_record.main["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA_victorlevasseur.tech_A]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Reading...
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Read complete after 0s [id=vltech-website-website-origin-aliases]
module.single_zone.module.revalidation_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-revalidation-function-lambda-policy]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/apple-icon.png/route"]: Refreshing state... [id=429e5dc9-949e-bfe8-5ea3-94ae1c0395dc]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/sitemap.xml"]: Refreshing state... [id=a75e242c-2925-3841-1ebf-4132a5a5d451]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/apple-icon.png/layout"]: Refreshing state... [id=ee4126fe-4ae9-1935-0648-6b05ab17c3df]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/apple-icon.png"]: Refreshing state... [id=7b04e70f-4fe3-38cb-5207-a06ecf3cfd0e]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/icon.svg"]: Refreshing state... [id=b099e8b2-8b61-8bd9-0d56-eac983ec13e4]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/icon.svg/route"]: Refreshing state... [id=6f0383d8-ddd3-b555-6383-030c2a8e8d64]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/page"]: Refreshing state... [id=4a50ac40-49e6-6d65-3d6f-3de68124de5a]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/_not-found/page"]: Refreshing state... [id=4078b19e-6992-460e-4701-15bf24e21d83]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/apple-icon.png"]: Refreshing state... [id=906b667f-99c6-daf7-b2c8-4471b15d5128]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/_not-found/layout"]: Refreshing state... [id=9907c176-4f6f-16a1-4c4a-ea5cf74e0c46]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/cgv/page"]: Refreshing state... [id=1ef67600-a23f-4d91-55f1-6cf940f78c5a]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/icon.svg"]: Refreshing state... [id=789fdffe-a76a-9699-1b44-c6084be2ecbe]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/favicon.ico"]: Refreshing state... [id=cf583347-4f07-992f-a9a6-5ec5f8c6b994]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/sitemap.xml/layout"]: Refreshing state... [id=27c97450-ddd6-4ead-87d0-2ec871d2d51f]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/_not-found"]: Refreshing state... [id=62d567e7-536d-61b4-1c6a-6d0a23656e52]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/cgv"]: Refreshing state... [id=97e483b2-3b35-0b73-6a04-15b86e272d48]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/favicon.ico/route"]: Refreshing state... [id=b9e70057-b536-556e-1d53-bb80a9973f92]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/cgv"]: Refreshing state... [id=29285823-9673-4a27-4486-76b832b27fc9]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/index"]: Refreshing state... [id=be2d7314-52da-7f3b-fae3-91dfe6f7832e]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/"]: Refreshing state... [id=d45788c7-bcd1-121f-c352-ca5952fc4d0a]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/sitemap.xml/route"]: Refreshing state... [id=e5a8b31b-309e-6cb4-7514-a09a559bb7d6]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/_not-found"]: Refreshing state... [id=9140c47e-bfc8-6cb5-a8f2-287e71a7733e]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/favicon.ico/layout"]: Refreshing state... [id=de17d4d9-362d-d639-6cb8-0d12be32baaf]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/cgv/layout"]: Refreshing state... [id=79165f03-8127-b41c-2dc2-d208c7f75cb3]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/icon.svg/layout"]: Refreshing state... [id=b1145f9a-e94a-662a-08f5-33e462b1768b]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/favicon.ico"]: Refreshing state... [id=acda99f9-84a3-c629-80ed-16074a82a42e]
module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/sitemap.xml"]: Refreshing state... [id=4b6ffc9e-ef5a-30c2-ced4-02c4d1512fee]
module.single_zone.module.revalidation_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-revalidation-function-role-20241218205629363600000001]
module.single_zone.module.revalidation_function.aws_lambda_alias.lambda_alias["stable"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:stable]
module.single_zone.aws_lambda_event_source_mapping.revalidation_queue_source: Refreshing state... [id=23604771-f7d2-432b-ba67-c4d45c3c7817]
module.single_zone.module.revalidation_function.terraform_data.update_alias[0]: Refreshing state... [id=1f5e9546-f060-7bc5-a9e0-bfa171f7916f]
module.single_zone.module.revalidation_function.aws_lambda_function_url.function_url["stable"]: Refreshing state... [id=vltech-website-revalidation-function/stable]
module.single_zone.module.image_optimisation_function[0].aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-image-optimization-function-lambda-policy]
module.single_zone.data.archive_file.server_function[0]: Reading...
module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-image-optimization-function]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_error-9b7125ad1a1e68fa.js"]: Refreshing state... [id=75ef6842-85f2-603c-3c4b-cd67c9b9561f]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/framework-a6eb4bce5bd8ed9b.js"]: Refreshing state... [id=2e38b1f6-e9cc-8645-2869-3d55b50564e3]
module.single_zone.module.s3_assets.terraform_data.file_sync["favicon.ico"]: Refreshing state... [id=d538d61d-dce0-cc44-df24-44711711892d]
module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/icon.svg.cache"]: Refreshing state... [id=1fb57270-96a2-95c3-ec41-25b726e9ae19]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/42aa6e6ea3b85651-s.woff2"]: Refreshing state... [id=59d3c0ee-ae3d-7390-a731-81f5168d647a]
module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/apple-icon.png.cache"]: Refreshing state... [id=01f78785-b296-6c14-9b59-61edeec98c0e]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-dbf93d4b3b66ee0d.js"]: Refreshing state... [id=f70e794e-46fc-f612-0b45-1bcaab0b96a8]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/cgv/page-2f9874ecc3099b18.js"]: Refreshing state... [id=34f45cf6-bb8a-9b44-d95d-0c917d12f956]
module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/cgv.cache"]: Refreshing state... [id=d301c61e-e70d-05d0-4baf-44e5705a5ea7]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/a8eac78432f0a60b-s.woff2"]: Refreshing state... [id=9e031051-5705-f03c-c644-4ca8b9261bf5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/4bd1b696-c579319bb9b05615.js"]: Refreshing state... [id=ac913217-a6e6-32d9-66ab-7bca99b23029]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/c740c1d45290834f-s.woff2"]: Refreshing state... [id=6c695a5c-d238-b55a-e737-abff99fcd32c]
module.single_zone.module.s3_assets.terraform_data.file_sync["documents/cgv.pdf"]: Refreshing state... [id=c76dce72-1386-d74a-4047-b8fa9d7b4f05]
module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/500.cache"]: Refreshing state... [id=344aae24-1890-01be-2764-9096c639fa3b]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/122c360d7fe6d395-s.p.woff2"]: Refreshing state... [id=674ad872-ee9b-89bd-9252-351607ab6caf]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/bc270b3a577192a7-s.woff2"]: Refreshing state... [id=16b8f0c3-94b5-168f-1fc9-f51adc0e8a3c]
module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/index.cache"]: Refreshing state... [id=9e106d95-0917-ff4d-79a7-765a27ce19c3]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/d0697bdd3fb49a78-s.woff2"]: Refreshing state... [id=9076105b-745e-e65e-ec39-f64e126aac2e]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-47d8fb00497672e4.js"]: Refreshing state... [id=a6a618da-575c-c65c-ffec-d19aeebed804]
module.single_zone.module.server_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-server-function-lambda-policy]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_app-d23763e3e6c904ff.js"]: Refreshing state... [id=a0a95740-9bd1-bbc5-3088-e6e5d18fff57]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-b5896372898a26b5.js"]: Refreshing state... [id=bc9d1baf-5248-765c-dec3-717d504374f3]
module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/favicon.ico.cache"]: Refreshing state... [id=f60d34ef-eef0-a6c4-9b6a-0cb06e1acf67]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/polyfills-42372ed130431b0a.js"]: Refreshing state... [id=83abb4c2-13d6-9782-a9c9-1f886e23d3a1]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9bbb7f84f3601865-s.woff2"]: Refreshing state... [id=325d0d9e-b078-18a5-55c7-a53c90d5c6d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/_not-found/page-b2447a23980919fd.js"]: Refreshing state... [id=86b17e9c-0ff0-125e-e384-6bbaf9c2d977]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-8afb5c88d2340613.js"]: Refreshing state... [id=466372c9-168c-2f72-f31f-51cac8590e83]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9f05b6a2725a7318-s.woff2"]: Refreshing state... [id=ac4a618e-66ed-1415-d02d-9d88a4c281ad]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/b8022cc0231a4bfd.css"]: Refreshing state... [id=715e82b9-4752-4d03-4e14-bba9b5b369bd]
module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/sitemap.xml.cache"]: Refreshing state... [id=a2f16666-00f9-f450-f4bf-bdbe19fb116b]
module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"]: Refreshing state... [id=9b076d43-7d40-c65b-4729-e23b19ed54d0]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/357398c3a461852b-s.woff2"]: Refreshing state... [id=e42276e7-9c0c-c131-fdcf-2a5abf5f7666]
module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/_not-found.cache"]: Refreshing state... [id=34a2fa5d-eaac-cf6c-d371-e28e4b373907]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/173-fc558b54b5be890b.js"]: Refreshing state... [id=bae8c547-8fd3-1d15-a8aa-1e2e1fb9c4d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/4d1af68a2715a16a-s.p.woff2"]: Refreshing state... [id=e72e9c33-e3f8-1fde-1eb0-6a73205452e8]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/lUAUMDP3pFC3fxrhB_SyO/_buildManifest.js"]: Refreshing state... [id=4dde6962-668f-ea35-2959-8489e232fa8c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/b32bc20a1e277f31-s.woff2"]: Refreshing state... [id=321d4549-ae06-3830-42eb-cfce7a6e73cf]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/01b81fc6c4002686.css"]: Refreshing state... [id=de26967e-7b67-5a54-f6e4-3b45a00acb1c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/7bafef50a4560c1d-s.woff2"]: Refreshing state... [id=271e32ae-abf0-ca24-a29d-49260817d15a]
module.single_zone.module.s3_assets.terraform_data.file_sync["assets/vltech_logo.png"]: Refreshing state... [id=5580fd80-287a-0715-aa66-6da5c311462b]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-app-d4c84837250c81b8.js"]: Refreshing state... [id=fbe0b5a6-0ff9-f248-fb8d-1f39b44a8105]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/382b6f43e60580be-s.woff2"]: Refreshing state... [id=02cd3ae0-21e8-4118-e990-2aebe2360167]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-984cbc839a680ab5.js"]: Refreshing state... [id=0326f31c-3e63-6c97-3dcd-1937ad8c78fc]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/978-2e23e15eb2d9825e.js"]: Refreshing state... [id=08c3e02a-0a97-2c74-2cfe-bc127cd57f15]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/lUAUMDP3pFC3fxrhB_SyO/_ssgManifest.js"]: Refreshing state... [id=324bdcc9-0884-2f7b-33e2-129a76338935]
module.single_zone.module.image_optimisation_function[0].aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-image-optimization-function-role-20241218205750570200000002]
module.single_zone.module.server_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-server-function-role-20241218205750451600000001]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205755531800000003]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:nextjs]
module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0]: Refreshing state... [id=84771ec1-fe46-cc5e-aa91-cf518f54444e]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-image-optimization-function/opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-image-optimization-function/nextjs]
module.single_zone.data.archive_file.server_function[0]: Read complete after 1s [id=43cfd438b6446f77db121ce4c0e40fe3cb40f12f]
module.single_zone.module.server_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-server-function]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:nextjs]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:opennext]
module.single_zone.module.server_function.aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205803707400000004]
module.single_zone.module.server_function.terraform_data.update_alias[0]: Refreshing state... [id=9c2dd8fe-7b02-35e8-28aa-e17dd58e004c]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-server-function/nextjs]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-server-function/opennext]
module.single_zone.module.public_resources[0].aws_cloudfront_distribution.production_distribution[0]: Refreshing state... [id=EU3DKQFOTEI79]
module.single_zone.module.public_resources[0].aws_route53_record.route53_aaaa_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_AAAA]
module.single_zone.module.public_resources[0].aws_route53_record.route53_a_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_A]
module.single_zone.terraform_data.update_aliases[0]: Refreshing state... [id=49c58d79-1f33-2d00-f3ea-d2bf33d20bfb]
module.single_zone.aws_s3_bucket_policy.bucket_policy[0]: Refreshing state... [id=vltech-website-website-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "ab826e214f8ef3ebf47db587582e9110",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "95295e0f116e74bb82472515df931554",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/_not-found/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "e0eca83bbbcd93d39c8ebc4379f45f37",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/_not-found/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "51109302808081cecf6e983f8b26b705",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "d221323a8d26cf7c7fbd7cfc27d8dc7d",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/apple-icon.png/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "b0fbab8490834d6bf4769255a7fb71fe",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/apple-icon.png/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "620972562bb777b404a15126a492a51b",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/cgv"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "0cbda893439997b9205c80e932a70151",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/cgv/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "4d120a8524a4fd9b60de79d5dd50b6ea",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/cgv/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "86af27a20719c7737e52bc8a16ac2318",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "437e6db5e70452f99e8422dedda5b0a6",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/favicon.ico/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "0babf123453678549a5412bdb1e9f010",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/favicon.ico/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "742da8e4c318fd26b1590927bd947340",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "5000c190b33fa58f0eb8b82c0b48e6f5",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/icon.svg/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "d36074e0ec29dd60400cdd006ee62978",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/icon.svg/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "c76919e42bad7fdbe477eb222a6e540a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/layout-3YwrDO7lBfRuelvUupW71/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "dd7771512e8c3f758d285459442b2e03",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/layout-3YwrDO7lBfRuelvUupW71/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "2e3496f1241b15db897036b27dd6570a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/layout-3YwrDO7lBfRuelvUupW71/cgv"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "466a267969a3a55673adf66e479ee201",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/layout-3YwrDO7lBfRuelvUupW71/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "390ae7f5bbfec948d71dacec9529be07",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/layout-3YwrDO7lBfRuelvUupW71/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "41904e132a58639101b5a42c34bdfa27",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/layout-3YwrDO7lBfRuelvUupW71/index"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "8bff550070ab9fed59e25744f8737061",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/layout-3YwrDO7lBfRuelvUupW71/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "ffa2c069cf3f5389207c91ccfd82a333",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "eec6df34d9fc32d47ca69aa69c9b4991",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "a9d7349b5813c5972cd0ebb1c1376918",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/sitemap.xml/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "196eddc4274607b4bb64dfdff50612c8",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["3YwrDO7lBfRuelvUupW71/_N_T_/sitemap.xml/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "ee41c480dd7f5ae96811c626ad85125c",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "d45788c7-bcd1-121f-c352-ca5952fc4d0a" -> null
      - triggers_replace = [
          - "nextjs",
          - "e21020d1fecde6c4f7f8a58eb99f0157",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/_not-found"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "9140c47e-bfc8-6cb5-a8f2-287e71a7733e" -> null
      - triggers_replace = [
          - "nextjs",
          - "8b0a89f09b1da6302e8238dbc1e3431f",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/_not-found/layout"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/_not-found/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "9907c176-4f6f-16a1-4c4a-ea5cf74e0c46" -> null
      - triggers_replace = [
          - "nextjs",
          - "47475f43c99457b29097893ae61949a1",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/_not-found/page"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/_not-found/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "4078b19e-6992-460e-4701-15bf24e21d83" -> null
      - triggers_replace = [
          - "nextjs",
          - "edf2390ac5b93fa9af86e55dfcc95fa7",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/apple-icon.png"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "906b667f-99c6-daf7-b2c8-4471b15d5128" -> null
      - triggers_replace = [
          - "nextjs",
          - "826ba10e4f9d4fecf674b2a1be899635",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/apple-icon.png/layout"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/apple-icon.png/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "ee4126fe-4ae9-1935-0648-6b05ab17c3df" -> null
      - triggers_replace = [
          - "nextjs",
          - "ff373452a729cc382d3ccb0c6dc3f1da",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/apple-icon.png/route"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/apple-icon.png/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "429e5dc9-949e-bfe8-5ea3-94ae1c0395dc" -> null
      - triggers_replace = [
          - "nextjs",
          - "31a4ea9afaa177f33e249d338ec60026",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/cgv"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/cgv"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "97e483b2-3b35-0b73-6a04-15b86e272d48" -> null
      - triggers_replace = [
          - "nextjs",
          - "e66e15027783f3b02ecbe80c8725a7bc",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/cgv/layout"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/cgv/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "79165f03-8127-b41c-2dc2-d208c7f75cb3" -> null
      - triggers_replace = [
          - "nextjs",
          - "0692fe30b4f73e956169407f4f489959",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/cgv/page"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/cgv/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "1ef67600-a23f-4d91-55f1-6cf940f78c5a" -> null
      - triggers_replace = [
          - "nextjs",
          - "af2b757ec16eb0a5a6dadbf23e4fb101",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/favicon.ico"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "acda99f9-84a3-c629-80ed-16074a82a42e" -> null
      - triggers_replace = [
          - "nextjs",
          - "31091b9a539df4be68a45df62d49a5cd",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/favicon.ico/layout"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/favicon.ico/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "de17d4d9-362d-d639-6cb8-0d12be32baaf" -> null
      - triggers_replace = [
          - "nextjs",
          - "4f34429597a11a62c58b8ab2125a9783",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/favicon.ico/route"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/favicon.ico/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b9e70057-b536-556e-1d53-bb80a9973f92" -> null
      - triggers_replace = [
          - "nextjs",
          - "917d31eea1c3464853d0abba16221ada",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/icon.svg"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b099e8b2-8b61-8bd9-0d56-eac983ec13e4" -> null
      - triggers_replace = [
          - "nextjs",
          - "43867b893707184bf572fbaf8e02f2aa",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/icon.svg/layout"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/icon.svg/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b1145f9a-e94a-662a-08f5-33e462b1768b" -> null
      - triggers_replace = [
          - "nextjs",
          - "12b1557cd78fd64b16b418739c232874",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/icon.svg/route"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/icon.svg/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "6f0383d8-ddd3-b555-6383-030c2a8e8d64" -> null
      - triggers_replace = [
          - "nextjs",
          - "716f5e430b9991b1c73befb8729ae2f1",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/_not-found"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "62d567e7-536d-61b4-1c6a-6d0a23656e52" -> null
      - triggers_replace = [
          - "nextjs",
          - "18e5d200b837bee6e49bf25cdb621c4f",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/apple-icon.png"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "7b04e70f-4fe3-38cb-5207-a06ecf3cfd0e" -> null
      - triggers_replace = [
          - "nextjs",
          - "b34c48dda3f3f50275b0239ec5a19d2e",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/cgv"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/cgv"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "29285823-9673-4a27-4486-76b832b27fc9" -> null
      - triggers_replace = [
          - "nextjs",
          - "db18264e755b98420a3df67a954acb34",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/favicon.ico"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "cf583347-4f07-992f-a9a6-5ec5f8c6b994" -> null
      - triggers_replace = [
          - "nextjs",
          - "7cfd47f781d47ac61a14c6559ebcb849",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/icon.svg"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "789fdffe-a76a-9699-1b44-c6084be2ecbe" -> null
      - triggers_replace = [
          - "nextjs",
          - "b5cfe7e26da97a5953a972a54e7d1937",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/index"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/index"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "be2d7314-52da-7f3b-fae3-91dfe6f7832e" -> null
      - triggers_replace = [
          - "nextjs",
          - "312480144fc5d038d8c16d1b84d923cd",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/sitemap.xml"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/layout-lUAUMDP3pFC3fxrhB_SyO/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "4b6ffc9e-ef5a-30c2-ced4-02c4d1512fee" -> null
      - triggers_replace = [
          - "nextjs",
          - "115d273219cc9e65d23bdcb505b59c4c",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/page"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "4a50ac40-49e6-6d65-3d6f-3de68124de5a" -> null
      - triggers_replace = [
          - "nextjs",
          - "11eddc9608a1d3edaf4a16d35e89bc35",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/sitemap.xml"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "a75e242c-2925-3841-1ebf-4132a5a5d451" -> null
      - triggers_replace = [
          - "nextjs",
          - "0ea18a3856452d0d9f58503665c8fe99",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/sitemap.xml/layout"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/sitemap.xml/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "27c97450-ddd6-4ead-87d0-2ec871d2d51f" -> null
      - triggers_replace = [
          - "nextjs",
          - "0bf86e459e4a3a8be0c0eb8680855fd0",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["lUAUMDP3pFC3fxrhB_SyO/_N_T_/sitemap.xml/route"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_N_T_/sitemap.xml/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "e5a8b31b-309e-6cb4-7514-a09a559bb7d6" -> null
      - triggers_replace = [
          - "nextjs",
          - "53879ff5dc4374666c8cb6ac048d9e7a",
        ] -> null
    }

  # module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-image-optimization-function"
      ~ last_modified                  = "2025-02-24T15:54:11.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:23" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:23/invocations" -> (known after apply)
      ~ source_code_hash               = "ioTD5t93qtC6PSU7Fh+DEKFL7+Ty4DsQDZAMiyK0xac=" -> "r11TqfgKNVXJ7MwEx1Eecer8NePA0pHpIDVfPqE/dbM="
        tags                           = {}
      ~ version                        = "23" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "84771ec1-fe46-cc5e-aa91-cf518f54444e" -> (known after apply)
      ~ triggers_replace = [
          ~ "23" -> (known after apply),
            "nextjs",
        ]
    }

  # module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-revalidation-function"
      ~ last_modified                  = "2025-02-24T15:53:56.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:23" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:23/invocations" -> (known after apply)
      ~ source_code_hash               = "em2CtHdsnW+J66zzSybGO/c0KYLu/KahfqLDeQ2GlmI=" -> "dFA5NNJ4fyNGI90uruaNFTkcs7WqtIIsAovBWAh0zMU="
        tags                           = {}
      ~ version                        = "23" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.single_zone.module.revalidation_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "1f5e9546-f060-7bc5-a9e0-bfa171f7916f" -> (known after apply)
      ~ triggers_replace = [
          ~ "23" -> (known after apply),
            "stable",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["3YwrDO7lBfRuelvUupW71/500.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "ead66eae20e42a41b50e876aaca9d193",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["3YwrDO7lBfRuelvUupW71/_not-found.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "1b31b49f79c8427382c15c696d294eaa",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["3YwrDO7lBfRuelvUupW71/apple-icon.png.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9843a61c98627e227286769373becd10",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["3YwrDO7lBfRuelvUupW71/cgv.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "262449810818000dd64929062b052f37",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["3YwrDO7lBfRuelvUupW71/favicon.ico.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "1253a11e7fded511c766a255028ab4ee",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["3YwrDO7lBfRuelvUupW71/icon.svg.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "31e8b96a370a0c0409d732d5d9c1d2d6",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["3YwrDO7lBfRuelvUupW71/index.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "e3e58ea4b735b2884c622a3795c27e2d",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["3YwrDO7lBfRuelvUupW71/sitemap.xml.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "f611a8e8bea5b12b8e7b5549ab12dc59",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"] must be replaced
-/+ resource "terraform_data" "file_sync" {
      ~ id               = "9b076d43-7d40-c65b-4729-e23b19ed54d0" -> (known after apply)
      ~ triggers_replace = [
            # (1 unchanged element hidden)
            "nextjs",
          ~ "7eb5d3f1bfe87ba44a02987066412fab" -> "b1c74f7cc16ac1ff10fa9c7d0266e0b5",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/3YwrDO7lBfRuelvUupW71/_buildManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9a9bc883f7801dfd30597cebfafa30d0",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/3YwrDO7lBfRuelvUupW71/_ssgManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "b404e23d62d95bafd03ad7747cc0e88b",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/lUAUMDP3pFC3fxrhB_SyO/_buildManifest.js"] will be destroyed
  # (because key ["_next/static/lUAUMDP3pFC3fxrhB_SyO/_buildManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "4dde6962-668f-ea35-2959-8489e232fa8c" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9a9bc883f7801dfd30597cebfafa30d0",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/lUAUMDP3pFC3fxrhB_SyO/_ssgManifest.js"] will be destroyed
  # (because key ["_next/static/lUAUMDP3pFC3fxrhB_SyO/_ssgManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "324bdcc9-0884-2f7b-33e2-129a76338935" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "b404e23d62d95bafd03ad7747cc0e88b",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/500.cache"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/500.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "344aae24-1890-01be-2764-9096c639fa3b" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "1956a97197b61859d7747803cb3ae293",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/_not-found.cache"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/_not-found.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "34a2fa5d-eaac-cf6c-d371-e28e4b373907" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "d2ada4a1d8af74a624c05efc8c5f4ab4",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/apple-icon.png.cache"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/apple-icon.png.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "01f78785-b296-6c14-9b59-61edeec98c0e" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9843a61c98627e227286769373becd10",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/cgv.cache"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/cgv.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "d301c61e-e70d-05d0-4baf-44e5705a5ea7" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9b4682f2f2d50e7d0d78f5090e4c84f1",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/favicon.ico.cache"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/favicon.ico.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "f60d34ef-eef0-a6c4-9b6a-0cb06e1acf67" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "1253a11e7fded511c766a255028ab4ee",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/icon.svg.cache"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/icon.svg.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "1fb57270-96a2-95c3-ec41-25b726e9ae19" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "31e8b96a370a0c0409d732d5d9c1d2d6",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/index.cache"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/index.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "9e106d95-0917-ff4d-79a7-765a27ce19c3" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "83a836ee3153a99871daf66a30bccfbd",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["lUAUMDP3pFC3fxrhB_SyO/sitemap.xml.cache"] will be destroyed
  # (because key ["lUAUMDP3pFC3fxrhB_SyO/sitemap.xml.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "a2f16666-00f9-f450-f4bf-bdbe19fb116b" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "ee0256df73ff8df6c47edcb5b701f34d",
        ] -> null
    }

  # module.single_zone.module.server_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-server-function"
      ~ last_modified                  = "2025-02-24T15:54:21.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:23" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:23/invocations" -> (known after apply)
      ~ source_code_hash               = "/tGpsTb2PmrXctNecXCwxFEQUVfXg7Ze4V6GiKgUOMI=" -> "IqBMe1DiQvkcgEdWW8ny99C+P1kBc/2n7t2LK2Dks9Q="
        tags                           = {}
      ~ version                        = "23" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.server_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "9c2dd8fe-7b02-35e8-28aa-e17dd58e004c" -> (known after apply)
      ~ triggers_replace = [
          ~ "23" -> (known after apply),
            "nextjs",
        ]
    }

Plan: 41 to add, 3 to change, 41 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Working Directory: `terraform`, Workflow: `PR Checks`*